swt/vorgehensmodelle.html
---
layout: page
title: Vorgehensmodelle
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Vorgehensmodelle</h2>
<div class="outline-text-2" id="text-1">
<p>
Beschreiben das Vorgehen eines Teams bei der Entwicklung von Software.
Generell unterscheidet man:
</p>

<ul class="org-ul">
<li>agile Modelle (z.B. Scrum):

<ul class="org-ul">
<li>sehr kleine Inkremente
</li>
<li>ständige Code-Verbesserung
</li>
<li>testgetriebene Entwicklung
</li>
<li>stärkere Nutzer-Involvierung
</li>
</ul>
</li>

<li>schwergewichtige Modelle (z.B. V-Modell, Wasserfallmodell)

<ul class="org-ul">
<li>Unterteilung des Entwicklungsprozesse in größe Phasen
</li>
<li>z.T. werden die Phasen sequentiell durchlaufen (z.B. beim
Wasserfallmodell)
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Schwergewichtige Vorgehensmodelle</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Wassefallmodell</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Sequentielles Entwicklungsmodell (jede Phase muss beendet sein, bevor
die nächste beginnt) Das Wasserfallmodell ist <i>Dokumentengetrieben</i>: Am
Ende jeder Phase stehen fertige Dokumente.
</p>

<ul class="org-ul">
<li>Machbarkeitsstudie: Prüfung der (technischen, personellen und
ökonomischen) Durchführbarkeit, Prüfung alternativer
Lösungsvorschläge. Erstellung des Lastenhefts.
</li>
<li>Anforderungsanalyse: funktionale und nicht-funktionale
Systembeschreibung. Erstellung von Pflichtenheft und
Anforderungsspezifikation
</li>
<li>Systementwurf: Entwurf der Softwarearchitektur
</li>
<li>Codieren &amp; Modultest: Erstellen der Sofwarekomponenten
</li>
<li>Integrations- und Systemtest: Liefern Testergebnisse
</li>
<li>Auslieferung und Installation: Erstellen der Handbücher
</li>
<li>Wartung:
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> V-Modell</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Das V-Modell ist eine Erweiterung des Wasserfallmodells und ergänzt
dieses um Aspekte der Qualitätssicherung. Verifikation und Validation
sind zentrale Bestandteile des V-Modells. Das V-Modell ist
<i>Qualitätsgetrieben</i>.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Rational Unified Process (RUP)</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Ein architekturzentriert und durch durch Anwendungsfälle gesteuerter
Entwicklungsprozess. Der RUP ist außerdem
</p>

<ul class="org-ul">
<li>objektorientiertert (Verwendung von UML-Notation)
</li>
<li>inkrementelle und iterativ (phasenübergreifende Aufgaben werden in
jeder Phase z.T. mehrfach durchlaufen).
</li>
</ul>

<p>
Die 4 Phasen des RUP sind:
</p>

<ol class="org-ol">
<li>Inception: Probleme analysieren, Projektbereich eingrenzen,
Entwicklung erster Anwendungsfälle
</li>
<li>Elaboration: Architektonische Grundlagen schaffen, Projektplan
entwickeln, Risiken erkennen und beseitigen
</li>
<li>Construction: Funktionalität entwickeln, integrieren und testen
</li>
<li>Transition: Projekt beim Benutzer installieren und einführen
</li>
</ol>

<p>
Phasenübergreifende Aufgaben (Workflows) zur Strukturierung:
</p>

<ol class="org-ol">
<li>Geschäftsprozessanalyse
</li>
<li>Anforderungsermittlung
</li>
<li>Analyse &amp; Entwurf
</li>
<li>Implementierung
</li>
<li>Test
</li>
<li>Installation
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Agile Vorgehensmodelle</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Scrum</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Wichtige Elemente von Scrum:
</p>

<ul class="org-ul">
<li><i>Sprint</i>: Ein Sprint ist ein Arbeitsabschnitt, in dem ein Inkrement
einer Produktfunktionalität implementiert wird. Das Ergebnis eines
Sprints ist der Abschluss der Implementierung eines Inkrements der
Funktionalität, wie es im <i>Sprint Planning</i> festgelegt wurde.
</li>
<li>Rollen:

<ul class="org-ul">
<li><i>pig roles</i> (hohes Commitment): Product Owner, Scrum Master, Team
</li>
<li><i>chicken roles</i> (geringes Commiment): Stakeholders, Managers
</li>
</ul>
</li>

<li><i>Product Backlog</i>: eine Aufgabenliste, die alle bekannten
funktionalen und nicht-funktionalen Anforderungen, sowie
unterstützende Aufgaben (Aufsetzen der Testumgebung) enthält.
</li>
</ul>
</div>
</div>
</div>
</div>
